const scriptName = "도감정보";
function addComma(num) {
    var regexp = /\B(?=(\d{3})+(?!\d))/g;
    return num.toString().replace(regexp, ',');
}

function S_convert(start, end) {
    var start2 = start + 6;
    var end2 = end + 6;
    if (start2 > 12) {
        start2 = start2 - 12;
    }
    if (end2 > 12) {
        end2 = end2 - 12;
    }
    return ("출현(남반구) : " + start2 + " ~ " + end2 + "월");
}

function response(room, msg, sender, isGroupChat, replier, ImageDB, packageName) {
    if (msg.indexOf("!정보 ") != -1) {
        var cmd = msg.split(" ")[0];
        var data = msg.split(" ")[1];
        var data2 = "";
        for (var i = 2; i < (msg.split(" ").length); i++) {
            var data2 = data2 + msg.split(" ")[i];
        }

        if (cmd == "!정보") {
            var searchplace, south, searchtime;
            var search = [0, 0, 0, 0];

            if (data == "물고기") {
                var fish = ["납줄개", "피라미", "붕어", "황어", "잉어", "비단잉어", "금붕어", "툭눈금붕어", "난주", "송사리", "가재", "자라", "늑대거북", "올챙이", "개구리", "동사리", "미꾸라지", "메기", "가물치", "블루길", "옐로우퍼치", "큰입배스", "틸라피아", "강꼬치고기", "빙어", "은어", "산천어", "열목어", "금송어", "일본연어", "연어", "왕연어", "참게", "구피", "닥터피시", "천사어", "베타", "네온테트라", "레인보우피시", "피라니아", "아로와나", "도라도", "가아", "피라루쿠", "엔드리캐리", "철갑상어", "클리오네", "해마", "흰동가리", "블루탱", "나비고기", "나폴레옹피시", "쏠배감펭", "복어", "가시복", "멸치", "전갱이", "돌돔", "농어", "도미", "가자미", "넙치", "오징어", "곰치", "리본장어", "다랑어", "청새치", "무명갈전갱이", "만새기", "개복치", "가오리", "톱상어", "귀상어", "상어", "고래상어", "빨판상어", "초롱아귀", "산갈치", "데메니기스", "실러캔스"];
                var place = ["강", "강", "강", "강", "연못", "연못", "연못", "연못", "연못", "연못", "연못", "강", "강", "연못", "연못", "강", "강", "연못", "연못", "강", "강", "강, 연못", "강", "강", "강", "강", "절벽 위", "절벽 위", "절벽 위", "절벽 위", "강 하구", "강 하구", "강", "강", "강", "강", "강", "강", "강", "강", "강", "강", "연못", "강", "강", "강 하구", "바다", "바다", "바다", "바다", "바다", "바다", "바다", "바다", "바다", "바다", "바다", "바다", "바다", "바다", "바다", "바다", "바다", "바다", "바다", "부둣가", "부둣가", "부둣가", "바다", "바다", "바다", "바다", "바다", "바다", "바다", "바다", "바다", "바다", "바다", "바다"];
                var month_start = [11, 0, 0, 0, 0, 0, 0, 0, 0, 4, 4, 8, 4, 3, 5, 0, 3, 5, 6, 0, 10, 0, 6, 9, 12, 7, -1, -1, -1, 12, 9, 9, 9, 4, 5, 5, 5, 4, 5, -1, 6, 6, 6, 6, 6, 9, 12, 4, 4, 4, 4, 7, 4, 11, 7, 0, 0, 3, 0, 0, 10, 0, 12, 8, 6, 11, -1, 5, 5, 7, 8, 6, 6, 6, 6, 6, 11, 12, 0, -1];
                var month_end = [3, 0, 0, 0, 0, 0, 0, 0, 0, 8, 9, 9, 10, 7, 8, 0, 5, 10, 8, 0, 3, 0, 10, 12, 2, 9, -1, -1, -1, 3, 9, 9, 11, 11, 9, 10, 10, 11, 10, -1, 9, 9, 9, 9, 9, 3, 3, 11, 9, 9, 9, 8, 11, 2, 9, 0, 0, 11, 0, 0, 4, 0, 8, 10, 10, 4, -1, 10, 10, 9, 11, 9, 9, 9, 9, 9, 3, 5, 0, -1];
                var time = ["24시간", "9 ~ 16시", "24시간", "16 ~ 9시", "24시간", "16 ~ 9시", "24시간", "9 ~ 16시", "9 ~ 16시", "24시간", "24시간", "16 ~ 9시", "21 ~ 4시", "24시간", "24시간", "16 ~ 9시", "24시간", "16 ~ 9시", "9 ~ 16시", "9 ~ 16시", "24시간", "24시간", "24시간", "24시간", "24시간", "24시간", "예외", "예외", "16 ~ 9시", "16 ~ 9시", "24시간", "24시간", "16 ~ 9시", "9 ~ 16시", "9 ~ 16시", "16 ~ 9시", "9 ~ 16시", "9 ~ 16시", "9 ~ 16시", "9 ~ 16시", "16 ~ 9시", "4 ~ 21시", "16 ~ 9시", "16 ~ 9시", "21 ~ 4시", "24시간", "24시간", "24시간", "24시간", "24시간", "24시간", "4 ~ 21시", "24시간", "21 ~ 4시", "24시간", "4 ~ 21시", "24시간", "24시간", "24시간", "24시간", "24시간", "24시간", "24시간", "24시간", "24시간", "24시간", "24시간", "24시간", "24시간", "4 ~ 21시", "4 ~ 21시", "16 ~ 9시", "16 ~ 9시", "16 ~ 9시", "24시간", "24시간", "16 ~ 9시", "24시간", "21 ~ 4시", "24시간"];
                var price = [900, 200, 160, 240, 300, 4000, 1300, 1300, 4500, 300, 200, 3750, 5000, 100, 120, 400, 400, 800, 5500, 180, 300, 400, 800, 1800, 500, 900, 1000, 3800, 15000, 15000, 700, 1800, 2000, 1300, 1500, 3000, 2500, 500, 800, 2500, 10000, 15000, 6000, 10000, 4000, 10000, 1000, 1100, 650, 1000, 1000, 10000, 500, 5000, 240, 200, 150, 5000, 400, 3000, 300, 800, 500, 2000, 600, 7000, 10000, 4500, 6000, 4000, 3000, 12000, 8000, 15000, 13000, 1500, 2500, 9000, 15000, 15000];
                if (msg == "!정보 물고기") {
                    replier.reply("물고기 정보 검색은\n'!정보 물고기 이름(종류)'\n와 같이 검색해주세요.");
                    return;
                } else {
                    for (var i = 0; i < fish.length + 1; i++) {
                        if (fish[i] == data2) {
                            search[0] = fish[i];
                            search[1] = month_start[i];
                            search[2] = month_end[i];
                            south = S_convert(month_start[i], month_end[i]);
                            searchtime = time[i];
                            searchplace = place[i];
                            search[3] = addComma(price[i]);
                            break;
                        } else if (i == fish.length) {
                            replier.reply("해당 물고기 정보가 없습니다.");
                            return;
                        }
                    }
                }
                if (search[1] == 0) {
                    replier.reply("<" + search[0] + " 정보>\n출현 : 1년 내내\n출현 시간 : " + searchtime + "\n출현 장소 : " + searchplace + "\n가격 : " + search[3] + "벨");
                } else if (search[1] != -1) {
                    if (search[1] == search[2]) {
                        replier.reply("<" + search[0] + " 정보>\n출현(북반구) : " + search[1] + "월\n출현(남반구) : " + (search[1] - 6) + "월\n출현 시간 : " + searchtime + "\n출현 장소 : " + searchplace + "\n가격 : " + search[3] + "벨");
                    } else {
                        replier.reply("<" + search[0] + " 정보>\n출현(북반구) : " + search[1] + " ~ " + search[2] + "월\n" + south + "\n출현 시간 : " + searchtime + "\n출현 장소 : " + searchplace + "\n가격 : " + search[3] + "벨");
                    }
                } else {
                    if (data2 == "산천어" || data2 == "열목어") {
                        replier.reply("<" + search[0] + " 정보>\n출현(북반구) : 3 ~ 6월/9 ~ 11월\n출현(남반구) : 9 ~12월/3 ~5월\n출현 시간 : " + searchtime + "\n출현 장소 : " + searchplace + "\n가격 : " + search[3] + "벨");
                    } else if (data2 == "금송어") {
                        replier.reply("<" + search[0] + " 정보>\n출현(북반구) : 3 ~ 5월/9 ~ 11월\n출현(남반구) : 9 ~11월/3 ~5월\n출현 시간 : " + searchtime + "\n출현 장소 : " + searchplace + "\n가격 : " + search[3] + "벨");
                    } else if (data2 == "피라니아") {
                        replier.reply("<" + search[0] + " 정보>\n출현(북반구) : 6 ~ 9월\n출현(남반구) : 12 ~ 3월\n출현 시간 : 9 ~16시/21 ~ 4시\n출현 장소 : " + searchplace + "\n가격 : " + search[3] + "벨");
                    } else if (data2 == "청새치") {
                        replier.reply("<" + search[0] + " 정보>\n출현(북반구) : 7 ~ 9월/11 ~ 4월\n출현(남반구) : 1 ~ 3월/5 ~ 10월\n출현 시간 : 24시간\n출현 장소 : " + searchplace + "\n가격 : " + search[3] + "벨");
                    } else if (data2 == "실러캔스") {
                        replier.reply("<" + search[0] + " 정보>\n출현 : 1년 내내\n출현 시간 : 24시간\n(비 오는 날만 출현)\n출현 장소 : " + searchplace + "\n가격 : " + search[3] + "벨");
                    }
                }
            } else if (data == "해산물") {
                var seafood = ["미역", "바다포도", "해삼", "바다돼지", "불가사리", "성게", "연필성게", "말미잘", "보름달물해파리", "갯민숭달팽이", "진주조개", "지중해담치", "굴", "가리비", "수랑", "소라", "전복", "대왕거거", "앵무조개", "문어", "우무문어", "흡혈오징어", "반딧불오징어", "꽃게", "던지니스크랩", "대게", "왕게", "따개비", "키다리게", "보리새우", "북쪽분홍새우", "갯가재", "닭새우", "바닷가재", "자이언트이소포드", "투구게", "멍게", "가든일", "납작벌레", "해로동혈"];
                var month_start = [10, 6, 11, 11, 0, 5, 5, 0, 7, 0, 0, 6, 9, 0, 0, -1, 6, 5, -1, 0, -1, 5, 3, 6, 11, 11, 11, 0, 3, 6, 9, 0, 10, -1, 7, 7, 4, 5, 8, 10];
                var month_end = [7, 9, 4, 2, 0, 9, 9, 0, 9, 0, 0, 12, 2, 0, 0, -1, 1, 9, -1, 0, -1, 8, 6, 11, 5, 4, 3, 0, 4, 9, 2, 0, 12, -1, 10, 9, 8, 10, 9, 2];
                var time = ["24시간", "24시간", "24시간", "16시 ~ 9시", "24시간", "24시간", "16시 ~ 9시", "24시간", "24시간", "24시간", "24시간", "24시간", "24시간", "24시간", "24시간", "24시간", "16시 ~ 9시", "24시간", "16시 ~ 9시", "24시간", "24시간", "16시 ~ 9시", "21시 ~ 4시", "24시간", "24시간", "24시간", "24시간", "24시간", "24시간", "16시 ~ 9시", "16시 ~ 9시", "16시 ~ 9시", "21시 ~ 4시", "24시간", "9시 ~ 16시/21시 ~ 4시", "21시 ~ 4시", "24시간", "4시 ~ 21시", "16시 ~ 9시", "24시간"];
                var price = [600, 900, 500, 10000, 500, 1700, 2000, 500, 600, 600, 2800, 1500, 1100, 1200, 1000, 1000, 2000, 15000, 1800, 1200, 6000, 10000, 1400, 2200, 1900, 6000, 8000, 600, 12000, 3000, 1400, 2500, 5000, 4500, 12000, 2500, 1500, 1100, 700, 5000];
                if (msg == "!정보 해산물") {
                    replier.reply("해산물 정보 검색은\n'!정보 해산물 이름(종류)'\n와 같이 검색해주세요.");
                    return;
                } else {
                    for (var i = 0; i < seafood.length + 1; i++) {
                        if (seafood[i] == data2) {
                            search[0] = seafood[i];
                            search[1] = month_start[i];
                            search[2] = month_end[i];
                            south = S_convert(month_start[i], month_end[i]);
                            searchtime = time[i];
                            search[3] = addComma(price[i]);
                            break;
                        } else if (i == seafood.length) {
                            replier.reply("해당 해산물 정보가 없습니다.");
                            return;
                        }
                    }
                }
                if (search[1] == 0) {
                    replier.reply("<" + search[0] + " 정보>\n출현 : 1년 내내\n출현 시간 : " + searchtime + "\n가격 : " + search[3] + "벨");
                } else if (search[1] != -1) {
                    replier.reply("<" + search[0] + " 정보>\n출현(북반구) : " + search[1] + " ~ " + search[2] + "월\n" + south + "\n출현 시간 : " + searchtime + "\n가격 : " + search[3] + "벨");
                } else {
                    if (data2 == "소라") {
                        replier.reply("<" + search[0] + " 정보>\n출현(북반구) : 3 ~ 5월/9 ~ 12월\n출현(남반구) : 3 ~ 6월/9 ~ 11월\n출현 시간 : 24시간\n가격 : " + search[3] + "벨");
                    } else if (data2 == "앵무조개") {
                        replier.reply("<" + search[0] + " 정보>\n출현(북반구) : 3 ~ 6월/9 ~ 11월\n출현(남반구) : 3 ~ 5월/9 ~ 12월\n출현 시간 : 16시 ~ 9시\n가격 : " + search[3] + "벨");
                    } else if (data2 == "우무문어") {
                        replier.reply("<" + search[0] + " 정보>\n출현(북반구) : 3 ~ 5월/9 ~ 11월\n출현(남반구) : 3 ~ 5월/9 ~ 11월\n출현 시간 : 24시간\n가격 : " + search[3] + "벨");
                    } else if (data2 == "바닷가재") {
                        replier.reply("<" + search[0] + " 정보>\n출현(북반구) : 4 ~ 6월/12 ~ 1월\n출현(남반구) : 6 ~ 7월/10 ~ 12월\n출현 시간 : 24시간\n가격 : " + search[3] + "벨");
                    }
                }
            } else if (data == "곤충") {
                var insect = ["배추흰나비", "노랑나비", "호랑나비", "제비나비", "청띠제비나비", "왕얼룩나비", "왕오색나비", "왕나비", "몰포나비", "아그리아스나비", "붉은목도리비단나비", "알렉산드라비단제비나비", "나방", "아틀라스나방", "마다가스카르비단제비나방", "방아깨비", "섬풀무치", "메뚜기", "여치", "귀뚜라미", "방울벌레", "사마귀", "연꽃사마귀", "꿀벌", "벌", "유지매미", "참매미", "곰매미", "애매미", "쓰르라미", "매미허물", "고추잠자리", "왕잠자리", "장수잠자리", "실잠자리", "반디", "땅강아지", "소금쟁이", "물방개", "물장군", "노린재", "인면노린재", "무당벌레", "길앞잡이", "비단벌레", "바이올린벌레", "알락하늘소", "루리하늘소", "유포루스바구미", "쇠똥구리", "보라금풍뎅이", "보석풍뎅이", "풍이", "골리앗왕꽃무지", "톱사슴벌레", "사슴벌레", "왕사슴벌레", "뮤엘러리사슴벌레", "엘라푸스가위사슴벌레", "황금사슴벌레", "기라파톱사슴벌레", "장수풍뎅이", "코카서스장수풍뎅이", "코끼리장수풍뎅이", "헤라클레스장수풍뎅이", "긴수염대벌레", "잎사귀벌레", "도롱이벌레", "개미", "소라게", "갯강구", "파리", "모기", "벼룩", "달팽이", "공벌레", "지네", "거미", "타란툴라", "전갈"];
                var place = ["공중", "공중", "공중", "검정/파랑/보라꽃", "공중", "공중", "공중", "공중", "공중", "공중", "꽃 주변", "공중", "공중(불빛 근처)", "나무", "공중", "풀밭", "풀밭", "풀밭", "풀밭(울음소리)", "풀밭", "풀밭", "꽃 위", "흰 꽃 위", "꽃 주변", "나무(흔들기)", "나무", "나무", "나무", "나무", "나무", "나무", "공중", "공중", "공중", "공중", "물가", "땅 속(소리)", "물 위", "물 위", "물 위", "꽃 위", "꽃 위", "꽃 위", "땅 위", "그루터기", "그루터기", "그루터기", "그루터기", "야자수", "눈덩이", "땅 위", "나무", "나무", "야자수", "나무", "나무", "나무", "나무", "야자수", "야자수", "야자수", "나무", "야자수", "야자수", "야자수", "나무", "나무 밑(가구 위장)", "나무(흔들기)", "썩은 무/사탕", "해변(소라 위장)", "해변 암반", "쓰레기/썩은 무/분수 불꽃의 재", "공중", "주민의 몸", "바위/낮은 묘목", "바위치기", "바위치기", "나무(흔들기)", "땅 위", "땅 위"];
                var month_start = [9, -1, 3, 3, 4, 0, 5, 9, -1, 4, -1, 5, 0, 4, 4, 4, 8, 8, 7, 9, 9, 3, 3, 3, 0, 7, 7, 7, 8, 7, 7, 9, 4, 5, 11, 6, 11, 5, 5, 4, 3, 3, -1, 2, 4, -1, 0, 5, 7, 12, 7, 7, 6, 6, 7, 7, 7, 6, 7, 7, 7, 7, 7, 7, 7, 7, 7, 0, 0, 0, 0, 0, 6, 4, -1, 9, 9, 0, 11, 5];
                var month_end = [6, -1, 9, 6, 8, 0, 8, 11, -1, 9, -1, 9, 0, 9, 9, 11, 11, 11, 9, 11, 10, 11, 11, 7, 0, 8, 8, 8, 9, 8, 8, 10, 10, 10, 2, 6, 5, 9, 9, 9, 10, 10, -1, 10, 8, -1, 0, 9, 8, 2, 9, 8, 8, 9, 8, 8, 8, 9, 8, 8, 8, 8, 8, 8, 8, 11, 9, 0, 0, 0, 0, 0, 9, 11, -1, 6, 6, 0, 4, 10];
                var time = ["4시 ~ 19시", "4시 ~ 19시", "4시 ~ 19시", "4시 ~ 19시", "4시 ~ 19시", "8시 ~ 19시", "4시 ~ 19시", "8시  17시", "17시 ~ 8시", "8시 ~ 17시", "8시 ~ 17시", "8시 ~ 16시", "19시 ~ 4시", "19시 ~ 4시", "8시 ~ 16시", "8시 ~ 19시", "8시 ~ 19시", "8시 ~ 19시", "8시 ~ 17시", "17시 ~ 8시", "17시 ~ 8시", "8시 ~ 17시", "8시 ~ 17시", "8시 ~ 17시", "24시간", "8시 ~ 17시", "8시 ~ 17시", "8시 ~ 17시", "8시 ~ 17시", "4시 ~ 8시/16시 ~ 19시", "24시간", "8시 ~19시", "8시 ~17시", "8시 ~17시", "24시간", "19시 ~ 4시", "24시간", "8시 ~ 19시", "8시 ~ 19시", "19시 ~ 8시", "24시간", "19시 ~ 8시", "8시 ~ 17시", "24시간", "24시간", "24시간", "24시간", "24시간", "24시간", "24시간", "24시간", "23시 ~ 8시", "24시간", "17시 ~ 8시", "24시간", "24시간", "23시 ~ 8시", "19시 ~ 8시", "17시 ~ 8시", "17시 ~ 8시", "17시 ~ 8시", "17시 ~ 8시", "17시 ~ 8시", "17시 ~ 8시", "17시 ~ 8시", "4시 ~8시/17시 ~ 19시", "24시간", "24시간", "24시간", "19시 ~ 8시", "24시간", "24시간", "17시 ~ 4시", "24시간", "24시간", "23시 ~ 16시", "16시 ~ 23시", "19시 ~ 8시", "19시 ~ 4시", "19시 ~ 4시"];
                var price = [160, 160, 240, 2500, 300, 1000, 3000, 140, 4000, 3000, 2500, 4000, 130, 3000, 2500, 200, 600, 160, 160, 130, 430, 430, 2400, 200, 2500, 250, 300, 500, 400, 550, 10, 180, 230, 4500, 500, 300, 500, 130, 800, 2000, 120, 1000, 200, 1500, 2400, 450, 350, 3000, 800, 3000, 300, 10000, 200, 8000, 2000, 1000, 10000, 6000, 8000, 12000, 12000, 1350, 8000, 8000, 12000, 600, 600, 600, 80, 1000, 200, 60, 130, 70, 250, 250, 300, 600, 8000, 8000];
                if (msg == "!정보 곤충") {
                    replier.reply("곤충 정보 검색은\n'!정보 곤충 이름(종류)'\n와 같이 검색해주세요.");
                    return;
                } else {
                    for (var i = 0; i < insect.length + 1; i++) {
                        if (insect[i] == data2) {
                            search[0] = insect[i];
                            search[1] = month_start[i];
                            search[2] = month_end[i];
                            south = S_convert(month_start[i], month_end[i]);
                            searchtime = time[i];
                            searchplace = place[i];
                            search[3] = addComma(price[i]);
                            break;
                        } else if (i == insect.length) {
                            replier.reply("해당 곤충 정보가 없습니다.");
                            return;
                        }
                    }
                }
                if (search[1] == 0) {
                    replier.reply("<" + search[0] + " 정보>\n출현 : 1년 내내\n출현 시간 : " + searchtime + "\n출현 장소 : " + searchplace + "\n가격 : " + search[3] + "벨");
                } else if (search[1] != -1) {
                    if (search[1] == search[2]) {
                        replier.reply("<" + search[0] + " 정보>\n출현(북반구) : " + search[1] + "월\n출현(남반구) : " + (search[1] + 6) + "월\n출현 시간 : " + searchtime + "\n출현 장소 : " + searchplace + "\n가격 : " + search[3] + "벨");
                    } else {
                        replier.reply("<" + search[0] + " 정보>\n출현(북반구) : " + search[1] + " ~ " + search[2] + "월\n" + south + "\n출현 시간 : " + searchtime + "\n출현 장소 : " + searchplace + "\n가격 : " + search[3] + "벨");
                    }
                } else {
                    if (data2 == "노랑나비") {
                        replier.reply("<" + search[0] + " 정보>\n출현(북반구) : 3 ~ 6월/9 ~ 10월\n출현(남반구) : 9 ~ 12월/3 ~ 4월\n출현 시간 : " + searchtime + "\n출현 장소 : " + searchplace + "\n가격 : " + search[3] + "벨");
                    } else if (data2 == "몰포나비") {
                        replier.reply("<" + search[0] + " 정보>\n출현(북반구) : 6 ~ 9월/12 ~ 3월\n출현(남반구) : 12 ~ 3월/6 ~ 9월\n출현 시간 : " + searchtime + "\n출현 장소 : " + searchplace + "\n가격 : " + search[3] + "벨");
                    } else if (data2 == "붉은복도리비단나비") {
                        replier.reply("<" + search[0] + " 정보>\n출현(북반구) : 4 ~ 9월/12월 ~ 2월\n출현(남반구) : 6 ~ 8월/10 ~ 3월\n출현 시간 : " + searchtime + "\n출현 장소 : " + searchplace + "\n가격 : " + search[3] + "벨");
                    } else if (data2 == "무당벌레") {
                        replier.reply("<" + search[0] + " 정보>\n출현(북반구) : 3 ~ 6월/10월\n출현(남반구) : 9 ~ 12월/4월\n출현 시간 : " + searchtime + "\n출현 장소 : " + searchplace + "\n가격 : " + search[3] + "벨");
                    } else if (data2 == "바이올린벌레") {
                        replier.reply("<" + search[0] + " 정보>\n출현(북반구) : 5 ~ 6월/9월 ~ 11월\n출현(남반구) : 11 ~ 12월/3 ~ 5월\n출현 시간 : " + searchtime + "\n출현 장소 : " + searchplace + "\n가격 : " + search[3] + "벨");
                    } else if (data2 == "달팽이") {
                        replier.reply("<" + search[0] + " 정보>\n출현 : 1년 내내(비 올 때)\n출현 시간 : " + searchtime + "\n출현 장소 : " + searchplace + "\n가격 : " + search[3] + "벨");
                    }
                }
            } else if (data == "네비링") {
                replier.reply("<네비링 정보>\n비밀");
            } else {
                replier.reply("도감 정보 검색 예시\n!정보 곤충 호랑나비\n!정보 물고기 농어");
            }
        }
    }
}